{"_id":"director_francisfordcoppola000","name":"Francis Ford Coppola","birthDate":"1939-04-07","deathDate":"","bio":"Francis Ford Coppola is an American film director, producer and screenwriter. He is considered one of the leading figures of the New Hollywood film movement of the 1960s and 1970s and is widely considered one of the greatest directors of all time. He is the recipient of five Academy Awards, six Golden Globe Awards, two Palmes d'Or and a British Academy Film Award (BAFTA). After directing The Rain People in 1969, Coppola co-wrote Patton (1970), which earned him the Academy Award for Best Original Screenplay along with Edmund H. North. Coppola's reputation as a filmmaker was cemented with the release of The Godfather (1972), which revolutionized the gangster genre of filmmaking, receiving strong commercial and critical reception. The Godfather won three Academy Awards: Best Picture, Best Actor and Best Adapted Screenplay (shared with Mario Puzo). The Godfather Part II (1974) became the first sequel to win the Academy Award for Best Picture. Highly regarded by critics, the film earned Coppola two more Academy Awards, for Best Adapted Screenplay and Best Director, making him the second director (after Billy Wilder) to win these three awards for the same film. Also in 1974, he released the thriller The Conversation, which received the Palme d'Or at the Cannes Film Festival. His next film, the war epic Apocalypse Now (1979), which had a notoriously lengthy and strenuous production, was widely acclaimed for vividly depicting the Vietnam War. It also won the Palme d'Or, making Coppola one of only ten filmmakers to have won the award twice. Other notable films Coppola has released since the start of the 1980s include the dramas The Outsiders and Rumble Fish (both 1983), The Cotton Club (1984), Peggy Sue Got Married (1986), The Godfather Part III (1990), Bram Stoker's Dracula (1992) and The Rainmaker (1997). Coppola has acted as producer on such diverse films as The Black Stallion (1979), The Escape Artist (1982), Hammett (1982), Mishima: A Life in Four Chapters (1985) and The Secret Garden (1993). Many of Coppola's relatives and children have become popular actors and filmmakers in their own right: his sister Talia Shire is an actress, his daughter Sofia is a director, his son Roman is a screenwriter, and his nephews Jason Schwartzman and Nicolas Cage are actors. Coppola resides in Napa, California, and since the 2010s has been a vintner, owning a family-branded winery of his own.","movies":["movie_thegodfather000","movie_thegodfatherpartii000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Francis_Ford_Coppola_%2833906700778%29_%28cropped%29.jpg/330px-Francis_Ford_Coppola_%2833906700778%29_%28cropped%29.jpg"}
{"_id":"director_frankdarabont000","name":"Frank Darabant","birthDate":"1959-01-28","deathDate":"","bio":"Frank Árpád Darabont (born Ferenc Árpád Darabont, January 28, 1959) is an American screenwriter, director and producer. He has been nominated for three Academy Awards and a Golden Globe Award. In his early career, he was primarily a screenwriter for such horror films as A Nightmare on Elm Street 3: Dream Warriors (1987), The Blob (1988) and The Fly II (1989). As a director, he is known for his film adaptations of Stephen King novellas and novels, such as The Shawshank Redemption (1994), The Green Mile (1999), and The Mist (2007).  Darabont also developed and executive-produced the first season and first half of the second season of the AMC horror series The Walking Dead (2010-2011).  Early life Darabont was born in a refugee camp in 1959 in Montbéliard, France. His parents had fled Hungary for France after the 1956 Hungarian Revolution, bringing his five brothers and four sisters, and three cousins. When Darabont was still an infant, his family immigrated to the United States, settling in Chicago before moving to Los Angeles when Darabont was five.  Darabont was inspired in his youth to pursue a career in film after seeing the George Lucas film THX 1138. Darabont graduated from Hollywood High School in 1977 and did not attend college.  His first job after finishing school was working at the famed Grauman's Egyptian Theatre in Hollywood. He served at the concession stand and as an usher, and was grateful for the perk of getting to watch numerous films for free. He claims he developed his writing skills from 'endless hours' of writing at a desk on a typewriter in his free time, and from his childhood friend Cody Hills.","movies":["movie_theshawshankredemption000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Frank_Darabont_at_the_PaleyFest_2011_-_The_Walking_Dead_panel.jpg/330px-Frank_Darabont_at_the_PaleyFest_2011_-_The_Walking_Dead_panel.jpg"}
{"_id":"director_christophernolan000","name":"Christopher Nolan","birthDate":"1970-07-30","deathDate":"","bio":"Christopher Edward Nolan CBE (born 30 July 1970) is a British-American filmmaker. Known for his Hollywood blockbusters with complex storytelling, Nolan is considered a leading filmmaker of the 21st century. He has received many accolades, including nominations for eight Academy Awards, and his films have grossed more than $6 billion worldwide, ranking him among the highest-grossing directors. In 2015, he was listed as one of the 100 most influential people in the world by Time, and in 2024, he was honoured with a British Film Institute Fellowship. Nolan developed an interest in filmmaking from a young age. After studying English literature at University College London, he made several short films before his feature film debut with Following (1998). Nolan gained international recognition with his second film, Memento (2000), for which he was nominated for the Academy Award for Best Original Screenplay. He transitioned from independent to studio filmmaking with Insomnia (2002), and found further critical and commercial success with The Dark Knight trilogy (2005-2012), The Prestige (2006) and Inception (2010); the last of these earned Nolan two Oscar nominations—Best Picture and Best Original Screenplay. This was followed by Interstellar (2014), Dunkirk (2017) and Tenet (2020). For the war drama Dunkirk, he earned two Academy Award nominations, including his first for Best Director. Parting ways with longtime distributor Warner Bros. Pictures, Nolan signed with Universal Pictures for the biopic Oppenheimer (2023), which won him the Golden Globe Award for Best Director. Nolan's work regularly features in the listings of best films of their respective decades. Infused with a metaphysical outlook, his films thematise epistemology, existentialism, ethics, the construction of time, and the malleable nature of memory and personal identity. They feature mathematically-inspired images and concepts, unconventional narrative structures, practical special effects, experimental soundscapes, large-format film photography, and materialistic perspectives. He has co-written several of his films with his brother, Jonathan, and runs the production company Syncopy Inc. with his wife, Emma Thomas.","movies":["movie_thedarkknight000","movie_inception000","movie_interstellar000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Christopher_Nolan_Cannes_2018.jpg/330px-Christopher_Nolan_Cannes_2018.jpg"}
{"_id":"director_sidneylumet000","name":"Sidney Lumet","birthDate":"1924-06-25","deathDate":"2011-04-09","bio":"Sidney Arthur Lumet was an American film director. Lumet started his career in theatre before transitioning to film where he gained a reputation for making realistic and gritty New York dramas which focused on the working class, tackled social injustices and often questioned authority. He was nominated five times for Academy Awards: four for Best Director for 12 Angry Men (1957), Dog Day Afternoon (1975), Network (1976), and The Verdict (1982) and one for Best Adapted Screenplay for Prince of the City (1981). Other films include A View from the Bridge (1962), Long Day's Journey into Night (1962), The Pawnbroker (1964), Fail Safe (1964), The Hill (1965), Murder on the Orient Express (1974), Equus (1977), The Wiz (1978), The Morning After (1986), Running on Empty (1988), and Before the Devil Knows You're Dead (2007). He received the Academy Honorary Award in 2004. A member of the inaugural class at New York's Actors Studio, Lumet started acting off-Broadway and made his Broadway acting debut in the 1935 play Dead End. He later went on to direct the Broadway plays Night of the Auk (1956), Caligula (1960), and Nowhere to Go But Up (1962). Lumet is also known for his work on television. He received a Primetime Emmy Award for Outstanding Directing for a Drama Series nomination for NBC Sunday Showcase (1961). He also directed for Goodyear Television Playhouse, Kraft Television Theatre, and Playhouse 90.","movies":["movie_12angrymen000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Sidney_Lumet_1970.jpg/330px-Sidney_Lumet_1970.jpg"}
{"_id":"director_sergioleone000","name":"Sergio Leone","birthDate":"1929-01-03","deathDate":"1989-04-30","bio":"Sergio Leone (3 January 1929 - 30 April 1989) was an Italian film director, producer, and screenwriter, credited as the pioneer of the spaghetti Western genre. He is widely regarded as one of the most influential directors in the history of cinema. Leone's film-making style includes juxtaposing extreme close-up shots with lengthy long shots. His films include the Dollars Trilogy of Westerns featuring Clint Eastwood: A Fistful of Dollars (1964), For a Few Dollars More (1965), and The Good, the Bad and the Ugly (1966); and the Once Upon a Time films: Once Upon a Time in the West (1968), Duck, You Sucker! (1971), and Once Upon a Time in America (1984).","movies":["movie_thegoodthebadandtheugly000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Sergio_Leone%2C_crop.jpg/330px-Sergio_Leone%2C_crop.jpg"}
{"_id":"director_quentintarantino000","name":"Quentin Tarantino","birthDate":"1963-03-27","deathDate":"","bio":"Quentin Jerome Tarantino (born March 27, 1963) is an American film director, screenwriter, and actor. His films are characterized by stylized violence, extended dialogue including a pervasive use of profanity, and references to popular culture. Tarantino began his career as an independent filmmaker with the release of the crime film Reservoir Dogs in 1992. His second film, Pulp Fiction (1994), a dark comedy crime thriller, was a major success with critics and audiences winning numerous awards, including the Palme d'Or and the Academy Award for Best Original Screenplay. In 1996, he wrote and starred in From Dusk till Dawn. Tarantino's third film, Jackie Brown (1997), paid homage to blaxploitation films. In 2003, Tarantino directed Kill Bill: Volume 1, inspired by the traditions of martial arts films; it was followed by Volume 2 in 2004, with both volumes combined regarded as a single film. He then made the exploitation-slasher Death Proof (2007), part of a double feature with Robert Rodriguez released under the collective title Grindhouse. His next film, Inglourious Basterds (2009), follows an alternate account of World War II. He followed this with Django Unchained (2012), a slave revenge Spaghetti Western, which won him his second Academy Award for Best Original Screenplay. His eighth film, The Hateful Eight (2015), is a revisionist Western thriller and opened to audiences with a roadshow release. His most recent film, Once Upon a Time in Hollywood (2019), is a comedy drama set in the late 1960s about the transition of Old Hollywood to New Hollywood. A novelization of the film written by Tarantino was published in 2021, becoming his debut novel. Tarantino's work has been subject to criticism, such as the depictions of violence and frequent inclusion of racial slurs. During Tarantino's career, his films have garnered a cult following; as well as critical and commercial success, he has been considered \"the single most influential director of his generation\". Other major awards won by Tarantino include two BAFTAs and four Golden Globes.","movies":["movie_pulpfiction000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Quentin_Tarantino_by_Gage_Skidmore.jpg/330px-Quentin_Tarantino_by_Gage_Skidmore.jpg"}
{"_id":"director_stevenspielberg000","name":"Steven Spielberg","birthDate":"1946-12-18","deathDate":"","bio":"Steven Spielberg is a bad ass director.","movies":["movie_schindlerslist000","movie_savingprivateryan000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/MKr25425_Steven_Spielberg_%28Berlinale_2023%29.jpg/330px-MKr25425_Steven_Spielberg_%28Berlinale_2023%29.jpg"}
{"_id":"director_peterjackson000","name":"Peter Jackson","birthDate":"1961-10-31","deathDate":"","bio":"Sir Peter Robert Jackson ONZ KNZM (born 31 October 1961) is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the Lord of the Rings trilogy (2001-2003) and the Hobbit trilogy (2012-2014), both of which are adapted from the novels of the same name by J. R. R. Tolkien. Other notable films include the critically lauded drama Heavenly Creatures (1994), the horror comedy The Frighteners (1996), the epic monster remake film King Kong (2005), the World War I documentary film They Shall Not Grow Old (2018) and the documentary The Beatles: Get Back (2021). He is the fourth-highest-grossing film director of all-time, his films having made over $6.5 billion worldwide. Jackson began his career with the 'splatstick' horror comedy Bad Taste (1987) and the black comedy Meet the Feebles (1989) before filming the zombie comedy Braindead (1992). He shared a nomination for Academy Award for Best Original Screenplay with his partner Fran Walsh for Heavenly Creatures, which brought him to mainstream prominence in the film industry. Jackson has been awarded three Academy Awards for The Lord of the Rings: The Return of the King (2003), including Best Picture, Best Director, and Best Adapted Screenplay. His other awards include three BAFTAs, a Golden Globe, two Primetime Emmy Awards and four Saturn Awards among others. His production company is WingNut Films, and his most regular collaborators are co-writers and producers Walsh and Philippa Boyens. Jackson was made a Companion of the New Zealand Order of Merit in 2002. He was later knighted (as a Knight Companion of the order) by Sir Anand Satyanand, the Governor-General of New Zealand, at a ceremony in Wellington in April 2010. In December 2014, Jackson was awarded a star on the Hollywood Walk of Fame.","movies":["movie_thelordoftheringsthereturnoftheking000","movie_thelordoftheringsthefellowshipofthering000","movie_thelordoftheringsthetwotowers000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Peter_Jackson_SDCC_2014.jpg/330px-Peter_Jackson_SDCC_2014.jpg"}
{"_id":"director_davidfincher000","name":"David Fincher","birthDate":"1962-08-28","deathDate":"","bio":"David Andrew Leo Fincher (born August 28, 1962) is an American film director. His films, most of which are psychological thrillers, have collectively grossed over $2.1 billion worldwide and have received 40 Academy Award nominations; this includes three Best Director nominations for him. He has also received four Primetime Emmy Awards, two Grammy Awards, a BAFTA Award, and a Golden Globe Award. Fincher co-founded the production company Propaganda Films in 1986. He directed numerous music videos for the company, including Madonna's \"Express Yourself\" in 1989 and \"Vogue\" in 1990, both of which won him the MTV Video Music Award for Best Direction. He received two Grammy Awards for Best Music Video for \"Love Is Strong\" (1994) by the Rolling Stones and \"Suit & Tie\" (2013) by Justin Timberlake featuring Jay-Z. He made his feature film debut with Alien 3 (1992) and gained his breakthrough with Seven (1995). He has since directed The Game (1997), Fight Club (1999), Panic Room (2002), Zodiac (2007), The Girl with the Dragon Tattoo (2011), Gone Girl (2014), and The Killer (2023). He received nominations for the Academy Award for Best Director for the dramas The Curious Case of Benjamin Button (2008), The Social Network (2010), and Mank (2020). In television, Fincher has served as an executive producer and director for the Netflix series House of Cards (2013-2018) and Mindhunter (2017-2019), winning the Primetime Emmy Award for Outstanding Directing for a Drama Series for the pilot episode of the former. He also executive produced and co-created the Netflix animated series Love, Death & Robots (2019-present) which received three Primetime Emmy Awards for Outstanding Short Form Animated Program.","movies":["movie_fightclub000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/TheKillerBFILFF051023_%288_of_22%29_%2853255176376%29_%28cropped2%29.jpg/330px-TheKillerBFILFF051023_%288_of_22%29_%2853255176376%29_%28cropped2%29.jpg"}
{"_id":"director_robertzemeckis000","name":"Robert Zemeckis","birthDate":"1952-05-14","deathDate":"","bio":"Robert Lee Zemeckis (born May 14, 1952) is an American film director, producer and screenwriter. He first came to public attention as the director of the action-adventure romantic comedy Romancing the Stone (1984), the science-fiction comedy Back to the Future film trilogy (1985-1990), and the live-action/animated comedy Who Framed Roger Rabbit (1988). He subsequently directed the satirical black comedy Death Becomes Her (1992) and then diversified into more dramatic fare, including Forrest Gump (1994), for which he won the Academy Award for Best Director. The film also won the Best Picture. He has directed films across a wide variety of genres, for both adults and families. Zemeckis is regarded as an innovator in visual effects. His exploration of state-of-the-art special effects includes the early use of computer graphics inserted into live-action footage in Back to the Future Part II (1989) and Forrest Gump, the insertion of hand-drawn animation into live-action footage in Who Framed Roger Rabbit, and the performance capture techniques seen in The Polar Express (2004), Beowulf (2007), A Christmas Carol (2009), and Welcome to Marwen (2018). He is known for his collaboration with composer Alan Silvestri, with whom he has worked since Romancing the Stone. David Thomson wrote that \"no other contemporary director has used special effects to more dramatic and narrative purpose.\"","movies":["movie_backtothefuture000","movie_forrestgump000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Robert_Zemeckis_%22The_Walk%22_at_Opening_Ceremony_of_the_28th_Tokyo_International_Film_Festival_%2821835891403%29_%28cropped%29.jpg/330px-Robert_Zemeckis_%22The_Walk%22_at_Opening_Ceremony_of_the_28th_Tokyo_International_Film_Festival_%2821835891403%29_%28cropped%29.jpg"}
{"_id":"director_milosforman000","name":"Miloš Forman","birthDate":"1932-02-18","deathDate":"2018-04-13","bio":"Jan Tomáš \"Miloš\" Forman (18 February 1932 - 13 April 2018) was a Czech-American film director, screenwriter, actor, and professor who rose to fame in his native Czechoslovakia before emigrating to the United States in 1968. Throughout Forman's career he won two Academy Awards, a BAFTA Award, three Golden Globe Awards, a Golden Bear, a César Award, and the Czech Lion. Forman was an important figure in the Czechoslovak New Wave. Film scholars and Czechoslovak authorities saw his 1967 film The Firemen's Ball as a biting satire on Eastern European Communism. The film was initially shown in theatres in his home country in the more reformist atmosphere of the Prague Spring. However, it was later banned by the Communist government after the invasion by the Warsaw Pact countries in 1968. Forman was subsequently forced to leave Czechoslovakia for the United States, where he continued making films. He received two Academy Awards for Best Director for the psychological drama One Flew Over the Cuckoo's Nest (1975) and the biographical drama Amadeus (1984). During this time, he also directed notable and acclaimed films such as Black Peter (1964), Loves of a Blonde (1965), Hair (1978), Ragtime (1981), Valmont (1989), The People vs. Larry Flynt (1996) and Man on the Moon (1999).","movies":["movie_oneflewoverthecuckoosnest000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Milos_Forman.jpg/330px-Milos_Forman.jpg"}
{"_id":"director_johnsturges000","name":"John Eliot Sturges","birthDate":"1910-01-03","deathDate":"1992-08-18","bio":"John Eliot Sturges (January 3, 1910 - August 18, 1992) was an American film director. His films include Bad Day at Black Rock (1955), Gunfight at the O.K. Corral (1957), The Magnificent Seven (1960), The Great Escape (1963), and Ice Station Zebra (1968). In 2013, The Magnificent Seven and 2018, Bad Day at Black Rock were selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".","movies":["movie_themagnificentseven000","movie_thegreatescape000"],"imagePath":"https://upload.wikimedia.org/wikipedia/en/0/0b/JohnSturgesImage.jpg"}
{"_id":"director_akirakurosawa000","name":"Akira Kurosawa","birthDate":"1910-03-23","deathDate":"1998-09-06","bio":"Akira Kurosawa (March 23, 1910 - September 6, 1998) was a Japanese filmmaker and painter who directed 30 films in a career spanning over five decades. He is widely regarded as one of the greatest and most influential filmmakers in the history of cinema. Kurosawa displayed a bold, dynamic style, strongly influenced by Western cinema yet distinct from it; he was involved with all aspects of film production. Kurosawa entered the Japanese film industry in 1936, following a brief stint as a painter. After years of working on numerous films as an assistant director and scriptwriter, he made his debut as a director during World War II with the popular action film Sanshiro Sugata (1943). After the war, the critically acclaimed Drunken Angel (1948), in which Kurosawa cast the then little-known actor Toshiro Mifune in a starring role, cemented the director's reputation as one of the most important young filmmakers in Japan. The two men would go on to collaborate on another fifteen films. Rashomon (1950), which premiered in Tokyo, became the surprise winner of the Golden Lion at the 1951 Venice Film Festival. The commercial and critical success of that film opened up Western film markets for the first time to the products of the Japanese film industry, which in turn led to international recognition for other Japanese filmmakers. Kurosawa directed approximately one film per year throughout the 1950s and early 1960s, including a number of highly regarded (and often adapted) films, such as Ikiru (1952), Seven Samurai (1954), Throne of Blood (1957), Yojimbo (1961) and High and Low (1963). After the 1960s he became much less prolific; even so, his later work—including two of his final films, Kagemusha (1980) and Ran (1985)—continued to receive great acclaim. In 1990, he accepted the Academy Award for Lifetime Achievement. Posthumously, he was named \"Asian of the Century\" in the \"Arts, Literature, and Culture\" category by AsianWeek magazine and CNN, cited there as being among the five people who most prominently contributed to the improvement of Asia in the 20th century. His career has been honored by many retrospectives, critical studies and biographies in both print and video, and by releases in many consumer media.","movies":["movie_sevensamurai000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Akirakurosawa-onthesetof7samurai-1953-page88.jpg/330px-Akirakurosawa-onthesetof7samurai-1953-page88.jpg"}
{"_id":"director_hayaomiyazaki000","name":"Hayao Miyazaki","birthDate":"1941-01-05","bio":"Hayao Miyazaki (born January 5, 1941) is a Japanese animator, filmmaker, and manga artist. A co-founder of Studio Ghibli, he has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation. Miyazaki's works are characterized by the recurrence of themes such as humanity's relationship with nature and technology, the wholesomeness of natural and traditional patterns of living, the importance of art and craftsmanship, and the difficulty of maintaining a pacifist ethic in a violent world. Miyazaki's works have been highly praised and awarded; he was named a Person of Cultural Merit for outstanding cultural contributions in November 2012, and received the Academy Honorary Award for his impact on animation and cinema in November 2014. Miyazaki has frequently been cited as an inspiration for numerous animators, directors, and writers.","movies":["movie_spiritedaway000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Hayao_Miyazaki_cropped_1_Hayao_Miyazaki_201211.jpg/330px-Hayao_Miyazaki_cropped_1_Hayao_Miyazaki_201211.jpg"}
{"_id":"director_bradbird000","name":"Brad Bird","birthDate":"1957-09-24","bio":"Brad Bird was born in Montana and grew up in Oregon. He developed an interest in the art of animation early on, and completed his first short subject by age 14. Bird sent the film to Walt Disney Productions, leading to an apprenticeship from the studio's Nine Old Men. In the 1980s, he worked in film development with various studios; he wrote the screenplay for *batteries not included, and developed two episodes of Amazing Stories for Steven Spielberg, including its spin-off (based on a segment written by Bird for the show), the widely panned animated sitcom Family Dog. Afterwards, Bird joined The Simpsons as creative consultant for eight seasons. He directed the 1999 feature The Iron Giant, adapted from a book by poet Ted Hughes; though critically lauded, it was a box-office bomb. He moved to Pixar where he wrote and directed two films, The Incredibles (2004) and Ratatouille (2007) that were worldwide critical and financial smash hits; both earned Bird two Academy Award for Best Animated Feature wins and Best Original Screenplay nominations. He transitioned to live-action filmmaking with 2011's similarly successful Mission: Impossible - Ghost Protocol, but his 2015 effort Tomorrowland significantly underperformed. He returned to Pixar to develop Incredibles 2, which was released in 2018 and became the second-highest-grossing animated film of all time.","movies":["movie_ratatouille000"],"imagePath":"https://upload.wikimedia.org/wikipedia/commons/3/3a/Brad_bird_cropped_2009.jpg"}
