{"_id":"movie_pulpfiction000","Title":"Pulp Fiction","ReleaseYear":"1994","Rating":"R","Runtime":"2h 34m","Description":"Pulp Fiction is a 1994 American independent crime film written and directed by Quentin Tarantino from a story he conceived with Roger Avary. It tells four intertwining tales of crime and violence in Los Angeles, California. The film stars John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman. The title refers to the pulp magazines and hardboiled crime novels popular during the mid-20th century, known for their graphic violence and punchy dialogue. Tarantino wrote Pulp Fiction in 1992 and 1993, incorporating scenes that Avary originally wrote for True Romance (1993). Its plot occurs out of chronological order. The film is also self-referential from its opening moments, beginning with a title card that gives two dictionary definitions of \"pulp\". Considerable screen time is devoted to monologues and casual conversations with eclectic dialogue revealing each character's perspectives on several subjects, and the film features an ironic combination of humor and strong violence. TriStar Pictures reportedly turned down the script as \"too demented\". Miramax co-chairman Harvey Weinstein was enthralled, however, and the film became the first that Miramax fully financed.","Genres":["genre_crime000","genre_drama000"],"Director":"director_quentintarantino000","Actors":["actor_johntravolta000","actor_samuelljackson000","actor_umathurman000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/3/3b/Pulp_Fiction_%281994%29_poster.jpg","Featured":true}
{"_id":"movie_thedarkknight000","Title":"The Dark Knight","ReleaseYear":"2008","Rating":"PG-13","Runtime":"2h 32m","Description":"The Dark Knight is a 2008 superhero film directed by Christopher Nolan from a screenplay co-written with his brother Jonathan. Based on the DC Comics superhero Batman, it is the sequel to Batman Begins (2005) and the second installment in The Dark Knight Trilogy. The plot follows the vigilante Batman, police lieutenant James Gordon, and district attorney Harvey Dent, who form an alliance to dismantle organized crime in Gotham City. Their efforts are derailed by the Joker, an anarchistic mastermind who seeks to test how far Batman will go to save the city from chaos. The ensemble cast includes Christian Bale, Michael Caine, Heath Ledger, Gary Oldman, Aaron Eckhart, Maggie Gyllenhaal, and Morgan Freeman.","Genres":["genre_action000","genre_crime000","genre_drama000"],"Director":"director_christophernolan000","Actors":["actor_christianbale000","actor_michaelcain000","actor_heathledger000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/1/1c/The_Dark_Knight_%282008_film%29.jpg","Featured":false}
{"_id":"movie_thegoodthebadandtheugly000","Title":"The Good, the Bad and the Ugly","ReleaseYear":"1966","Rating":"Approved","Runtime":"2h 58m","Description":"The Good, the Bad and the Ugly (Italian: Il buono, il brutto, il cattivo, literally 'The good, the ugly, the bad') is a 1966 Italian epic spaghetti Western film directed by Sergio Leone and starring Clint Eastwood as 'the Good', Lee Van Cleef as 'the Bad', and Eli Wallach as 'the Ugly'. The plot revolves around three gunslingers competing to find a fortune in a buried cache of Confederate gold amid the violent chaos of the American Civil War (specifically the Battle of Glorieta Pass of the New Mexico Campaign in 1862) while participating in many battles, confrontations, and duels along the way. The film was the third collaboration between Leone and Clint Eastwood, and the second with Lee Van Cleef.","Genres":["genre_adventure000","genre_western000"],"Director":"director_sergioleone000","Actors":["actor_clinteastwood000","actor_leevancleef000","actor_eliwallach000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/4/45/Good_the_bad_and_the_ugly_poster.jpg","Featured":false}
{"_id":"movie_schindlerslist000","Title":"Schindler's List","ReleaseYear":"1993","Rating":"R","Runtime":"3h 15m","Description":"Schindler's List is a 1993 American epic historical drama film directed and produced by Steven Spielberg and written by Steven Zaillian. It is based on the 1982 novel Schindler's Ark by Australian novelist Thomas Keneally. The film follows Oskar Schindler, a German industrialist who saved more than a thousand mostly Polish Jewish refugees from the Holocaust by employing them in his factories during World War II. It stars Liam Neeson as Schindler, Ralph Fiennes as SS officer Amon Goth, and Ben Kingsley as Schindler's Jewish accountant Itzhak Stern.","Genres":["genre_biography000","genre_drama000","genre_history000","genre_war000"],"Director":"director_stevenspielberg000","Actors":["actor_liamneeson000","actor_benkingsley000","actor_ralphfiennes000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/3/38/Schindler%27s_List_movie.jpg","Featured":false}
{"_id":"movie_thegodfather000","Title":"The Godfather","ReleaseYear":"1972","Rating":"R","Runtime":"2h 55m","Description":"The Godfather is a 1972 American epic crime film directed by Francis Ford Coppola, who co-wrote the screenplay with Mario Puzo, based on Puzo's best-selling 1969 novel of the same title. The film stars Marlon Brando, Al Pacino, James Caan, Richard Castellano, Robert Duvall, Sterling Hayden, John Marley, Richard Conte and Diane Keaton. It is the first installment in The Godfather trilogy, chronicling the Corleone family under patriarch Vito Corleone (Brando) from 1945 to 1955. It focuses on the transformation of his youngest son, Michael Corleone (Pacino), from reluctant family outsider to ruthless mafia boss.","Genres":["genre_crime000","genre_drama000"],"Director":"director_francisfordcoppola000","Actors":["actor_marlonbrando000","actor_alpacino000","actor_jamescaan000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/1/1c/Godfather_ver1.jpg","Featured":false}
{"_id":"movie_forrestgump000","Title":"Forrest Gump","ReleaseYear":"1994","Rating":"PG-13","Runtime":"2h 22m","Description":"Forrest Gump is a 1994 American comedy-drama film directed by Robert Zemeckis and written by Eric Roth. It is based on the 1986 novel of the same name by Winston Groom and stars Tom Hanks, Robin Wright, Gary Sinise, Mykelti Williamson and Sally Field. The film follows several decades in the life of a slow-witted yet kindhearted Alabama man named Forrest Gump (Hanks) and his experiences in the 20th-century United States. The film differs substantially from the novel.","Genres":["genre_drama000","genre_romance000"],"Director":"director_robertzemeckis000","Actors":["actor_tomhanks000","actor_robinwright000","actor_garysinise000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/6/67/Forrest_Gump_poster.jpg","Featured":false}
{"_id":"movie_thelordoftheringsthefellowshipofthering000","Title":"The Lord of the Rings: The Fellowship of the Ring","ReleaseYear":"2001","Rating":"PG-13","Runtime":"2h 58m","Description":"The Lord of the Rings: The Fellowship of the Ring is a 2001 epic fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, and Jackson, based on 1954's The Fellowship of the Ring, the first volume of the novel The Lord of the Rings by J. R. R. Tolkien. The film is the first instalment in The Lord of the Rings trilogy. It features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Billy Boyd, Dominic Monaghan, Orlando Bloom, Christopher Lee, Hugo Weaving, Sean Bean, Ian Holm, and Andy Serkis. Set in Middle-earth, the story tells of the Dark Lord Sauron, who seeks the One Ring, which contains part of his might, to return to power. The Ring has found its way to the young hobbit Frodo Baggins. The fate of Middle-earth hangs in the balance as Frodo and eight companions (who form the Fellowship of the Ring) begin their perilous journey to Mount Doom in the land of Mordor, the only place where the Ring can be destroyed. The Fellowship of the Ring was financed and distributed by American studio New Line Cinema, but filmed and edited entirely in Jackson's native New Zealand, concurrently with the other two parts of the trilogy.","Genres":["genre_action000","genre_adventure000","genre_drama000"],"Director":"director_peterjackson000","Actors":["actor_elijahwood000","actor_ianmckellen000","actor_livtyler000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/8/8a/The_Lord_of_the_Rings%2C_TFOTR_%282001%29.jpg","Featured":false}
{"_id":"movie_thelordoftheringsthereturnoftheking000","Title":"The Lord of the Rings: The Return of the King","ReleaseYear":"2003","Rating":"PG-13","Runtime":"3h 21m","Description":"The Lord of the Rings: The Return of the King is a 2003 epic fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, and Jackson. It is based on 1955's The Return of the King, the third volume of the novel The Lord of the Rings by J. R. R. Tolkien. The sequel to 2002's The Lord of the Rings: The Two Towers, the film is the final instalment in The Lord of the Rings trilogy. It features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Bernard Hill, Billy Boyd, Dominic Monaghan, Orlando Bloom, Hugo Weaving, Miranda Otto, David Wenham, Karl Urban, John Noble, Andy Serkis, Ian Holm, and Sean Bean. Continuing the plot of the previous film, Frodo, Sam and Gollum are making their final way toward Mount Doom to destroy the One Ring, unaware of Gollum's true intentions, while Merry, Pippin, Gandalf, Aragorn, Legolas, Gimli and the others join forces together against Sauron and his legions in Minas Tirith.","Genres":["genre_action000","genre_adventure000","genre_drama000"],"Director":"director_peterjackson000","Actors":["actor_elijahwood000","actor_ianmckellen000","actor_livtyler000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/2/23/The_Lord_of_the_Rings%2C_TROTK_%282003%29.jpg","Featured":false}
{"_id":"movie_fightclub000","Title":"Fight Club","ReleaseYear":"1999","Rating":"R","Runtime":"2h 19m","Description":"Fight Club is a 1999 American film directed by David Fincher and starring Brad Pitt, Edward Norton, and Helena Bonham Carter. It is based on the 1996 novel of the same name by Chuck Palahniuk. Norton plays the unnamed narrator, who is discontented with his white-collar job. He forms a 'fight club' with soap salesman Tyler Durden (Pitt), and becomes embroiled in a relationship with an impoverished but beguilingly attractive woman, Marla Singer (Bonham Carter).","Genres":["genre_drama000"],"Director":"director_davidfincher000","Actors":["actor_bradpitt000","actor_edwardnorton000","actor_helenabonhamcarter000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/f/fc/Fight_Club_poster.jpg","Featured":false}
{"_id":"movie_oneflewoverthecuckoosnest000","Title":"One Flew Over the Cuckoo's Nest","ReleaseYear":"1975","Rating":"R","Runtime":"2h 13m","Description":"One Flew Over the Cuckoo's Nest is a 1975 American psychological drama film directed by Miloš Forman, based on the novel One Flew Over the Cuckoo's Nest by Ken Kesey. The film stars Jack Nicholson as a new patient at a mental institution, alongside Louise Fletcher as an austere nurse. The supporting cast is Will Sampson, Danny DeVito, Sydney Lassick, William Redfield, and the film debuts of Christopher Lloyd and Brad Dourif.","Genres":["genre_drama000"],"Director":"director_milosforman000","Actors":["actor_jacknicholson000","actor_louisefletcher000","actor_williamredfield000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/2/26/One_Flew_Over_the_Cuckoo%27s_Nest_poster.jpg","Featured":false}
{"_id":"movie_thelordoftheringsthetwotowers000","Title":"The Lord of the Rings: The Two Towers","ReleaseYear":"2002","Rating":"PG-13","Runtime":"2h 59m","Description":"The Lord of the Rings: The Two Towers is a 2002 epic fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, Stephen Sinclair, and Jackson, based on 1954's The Two Towers, the second volume of the novel The Lord of the Rings by J. R. R. Tolkien. The sequel to 2001's The Lord of the Rings: The Fellowship of the Ring, the film is the second instalment in The Lord of the Rings trilogy. It features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Bernard Hill, Christopher Lee, Billy Boyd, Dominic Monaghan, Orlando Bloom, Hugo Weaving, Miranda Otto, David Wenham, Brad Dourif, Karl Urban, and Andy Serkis. Continuing the plot of the previous film, it intercuts three storylines: Frodo and Sam continue their journey towards Mordor to destroy the One Ring, now aided by Gollum, the ring's untrustworthy former bearer. Merry and Pippin escape their orc captors, meet Treebeard the Ent, and help to plan an attack on Isengard, fortress of Saruman. Aragorn, Legolas, and Gimli, in their pursuit, come to the war-torn nation of Rohan, and are reunited with the resurrected Gandalf before fighting against the legions of the treacherous wizard Saruman at the Battle of Helm's Deep.","Genres":["genre_action000","genre_adventure000","genre_drama000"],"Director":"director_peterjackson000","Actors":["actor_elijahwood000","actor_ianmckellen000","actor_livtyler"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/f/fc/The_Lord_of_the_Rings%2C_T2T_%282002%29.jpg","Featured":false}
{"_id":"movie_theshawshankredemption000","Title":"The Shawshank Redemption","ReleaseYear":"1994","Rating":"R","Runtime":"2h 22m","Description":"The Shawshank Redemption is a 1994 American prison drama film written and directed by Frank Darabont, based on the 1982 Stephen King novella Rita Hayworth and Shawshank Redemption. The film tells the story of banker Andy Dufresne (Tim Robbins), who is sentenced to life in Shawshank State Penitentiary for the murders of his wife and her lover, despite his claims of innocence. Over the following two decades, he befriends a fellow prisoner, contraband smuggler Ellis Redding (Morgan Freeman), and becomes instrumental in a money laundering operation led by the prison warden Samuel Norton (Bob Gunton). William Sadler, Clancy Brown, Gil Bellows, and James Whitmore appear in supporting roles.","Genres":["genre_drama000"],"Director":"director_frankdarabont000","Actors":["actor_timrobbins000","actor_morganfreeman000","actor_bobgunton000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/8/81/ShawshankRedemptionMoviePoster.jpg","Featured":false}
{"_id":"movie_sevensamurai000","Title":"Seven Samurai","ReleaseYear":"1954","Rating":"Not Rated","Runtime":"3h 27m","Description":"Seven Samurai is a 1954 Japanese epic samurai film co-written, edited, and directed by Akira Kurosawa. Taking place in 1586 in the Sengoku period of Japanese history, it follows the story of a village of desperate farmers who seek to hire masterless samurai to combat bandits who will return after the harvest to steal their crops.","Genres":["genre_action000","genre_drama000"],"Director":"director_akirakurosawa000","Actors":["actor_toshiromifune000","actor_takashishimura000","actor_keikotsushima000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Seven_Samurai_poster.jpg/330px-Seven_Samurai_poster.jpg","Featured":false}
{"_id":"movie_interstellar000","Title":"Interstellar","ReleaseYear":"2014","Rating":"PG-13","Runtime":"2h 48m","Description":"Interstellar is a 2014 epic science fiction film co-written, directed, and produced by Christopher Nolan. It stars Matthew McConaughey, Anne Hathaway, Jessica Chastain, Bill Irwin, Ellen Burstyn, Michael Caine, and Matt Damon. Set in a dystopian future where humanity is embroiled in a catastrophic blight and famine, the film follows a group of astronauts who travel through a wormhole near Saturn in search of a new home for humankind.","Genres":["genre_adventure000","genre_drama000","genre_scifi000"],"Director":"director_christophernolan000","Actors":["actor_matthewmcconaughey000","actor_annehathaway","actor_jessicachastain"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/b/bc/Interstellar_film_poster.jpg","Featured":false}
{"_id":"movie_thegodfatherpartii000","Title":"The Godfather Part II","ReleaseYear":"1974","Rating":"R","Runtime":"3h 22m","Description":"The Godfather Part II is a 1974 American epic crime film. The film is produced and directed by Francis Ford Coppola, loosely based on the 1969 novel The Godfather by Mario Puzo. The film is both a sequel and a prequel to The Godfather, presenting parallel dramas: one picks up the 1958 story of Michael Corleone (Al Pacino), the new Don of the Corleone crime family, protecting the family business in the aftermath of an attempt on his life; the prequel covers the journey of his father, Vito Corleone (Robert De Niro), from his Sicilian childhood to the founding of his family enterprise in New York City.","Genres":["genre_crime000","genre_drama000"],"Director":"director_francisfordcoppola000","Actors":["actor_alpacino000","actor_robertdeniro000","actor_robertduvall000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/0/03/Godfather_part_ii.jpg","Featured":false}
{"_id":"movie_savingprivateryan000","Title":"Saving Private Ryan","ReleaseYear":"1998","Rating":"R","Runtime":"2h 49m","Description":"Tom Hanks plays a bad ass history teacher in this movie.","Genres":["genre_drama000","genre_war000"],"Director":"director_stevenspielberg000","Actors":["actor_tomhanks000","actor_edwardburns000","actor_mattdamon000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/a/ac/Saving_Private_Ryan_poster.jpg","Featured":false}
{"_id":"movie_12angrymen000","Title":"12 Angry Men","ReleaseYear":"1957","Rating":"Approved","Runtime":"1h 36m","Description":"12 Angry Men is a 1957 American legal drama film directed by Sidney Lumet, adapted from a 1954 teleplay of the same name by Reginald Rose. The film tells the story of a jury of 12 men as they deliberate the conviction or acquittal of a teenager charged with murder on the basis of reasonable doubt; disagreement and conflict among them force the jurors to question their morals and values. It stars Henry Fonda (who also produced the film with Reginald Rose), Lee J. Cobb, Ed Begley, E. G. Marshall, and Jack Warden.","Genres":["genre_crime000","genre_drama000"],"Director":"director_sidneylumet000","Actors":["actor_henryfonda000","actor_leejcobb000","actor_edbegley000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/12_Angry_Men_%281957_film_poster%29.jpg/330px-12_Angry_Men_%281957_film_poster%29.jpg","Featured":false}
{"_id":"movie_themagnificentseven000","Title":"The Magnificent Seven","ReleaseYear":"1960","Rating":"Approved","Runtime":"2h 8m","Description":"The Magnificent Seven is a 1960 American Western film directed by John Sturges. The screenplay, credited to William Roberts, is a remake in an Old West-style of Akira Kurosawa's 1954 Japanese film Seven Samurai (itself initially released in the United States as The Magnificent Seven). The ensemble cast includes Yul Brynner, Steve McQueen, Charles Bronson, Robert Vaughn, Brad Dexter, James Coburn, and Horst Buchholz as a group of seven gunfighters and Eli Wallach as their main antagonist. The seven title characters are hired to protect a small village in Mexico from a group of marauding bandits led by Wallach.","Genres":["genre_action000","genre_adventure000","genre_drama000"],"Director":"director_johnsturges000","Actors":["actor_yulbrynner000","actor_eliwallach000","actor_stevemcqueen000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/The_Magnificent_Seven_%281960_poster%29.jpg/330px-The_Magnificent_Seven_%281960_poster%29.jpg","Featured":false}
{"_id":"movie_inception000","Title":"Inception","ReleaseYear":"2010","Rating":"PG-13","Runtime":"2h 28m","Description":"Inception is a 2010 science fiction action film written and directed by Christopher Nolan, who also produced the film with Emma Thomas, his wife. The film stars Leonardo DiCaprio as a professional thief who steals information by infiltrating the subconscious of his targets. He is offered a chance to have his criminal history erased, as payment for the implantation of another person's idea into a target's subconscious. The ensemble cast includes Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard, Elliot Page, Tom Hardy, Cillian Murphy, Tom Berenger, Dileep Rao and Michael Caine.","Genres":["genre_action000","genre_adventure000","genre_scifi000"],"Director":"director_christophernolan000","Actors":["actor_leonardodicaprio000","actor_kenwatanabe000","actor_josephgordonlevitt000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/2/2e/Inception_%282010%29_theatrical_poster.jpg","Featured":false}
{"_id":"movie_thegreatescape000","Title":"The Great Escape","ReleaseYear":"1963","Rating":"Approved","Runtime":"2h 52m","Description":"The Great Escape is a 1963 American epic war suspense adventure film starring Steve McQueen, James Garner and Richard Attenborough and featuring James Donald, Charles Bronson, Donald Pleasence, James Coburn, Hannes Messemer, David McCallum, Gordon Jackson, John Leyton and Angus Lennie. It was filmed in Panavision, and its musical score was composed by Elmer Bernstein.","Genres":["genre_adventure000","genre_drama000","genre_history000"],"Director":"director_johnsturges000","Actors":["actor_stevemcqueen000","actor_jamesgarner000","actor_richardattenborough000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/a/ac/The_Great_Escape_%28film%29_poster.jpg","Featured":false}
{"_id":"movie_backtothefuture000","Title":"Back to the Future","ReleaseYear":"1985","Rating":"PG","Runtime":"1h 56m","Description":"Back to the Future is a 1985 American science fiction film directed by Robert Zemeckis and written by Zemeckis and Bob Gale. It stars Michael J. Fox, Christopher Lloyd, Lea Thompson, Crispin Glover, and Thomas F. Wilson. Set in 1985, it follows Marty McFly (Fox), a teenager accidentally sent back to 1955 in a time-traveling DeLorean automobile built by his eccentric scientist friend Emmett \"Doc\" Brown (Lloyd), where he inadvertently prevents his future parents from falling in love, threatening his own existence, and is forced to reconcile them and somehow get back to the future.","Genres":["genre_adventure000","genre_comedy000","genre_scifi000"],"Director":"director_robertzemeckis000","Actors":["actor_michaeljfox000","actor_christopherlloyd000","actor_leathompson000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/d/d2/Back_to_the_Future.jpg","Featured":false}
{"_id":"movie_spiritedaway000","Title":"Spirited Away","ReleaseYear":"2001","Rating":"PG","Runtime":"2h 5m","Description":"Spirited Away is a 2001 Japanese animated fantasy film written and directed by Hayao Miyazaki, animated by Studio Ghibli for Tokuma Shoten, Nippon Television Network, Dentsu, Buena Vista Home Entertainment, Tohokushinsha Film, and Mitsubishi and distributed by Toho. Spirited Away tells the story of Chihiro \"Sen\" Ogino, a ten-year-old girl who, while moving to a new neighborhood, enters the world of kami (spirits of Japanese Shinto folklore). After her parents are turned into pigs by the witch Yubaba, Chihiro takes a job working in Yubaba's bathhouse to find a way to free herself and her parents and return to the human world.","Genres":["genre_animation000","genre_adventure000"],"Director":"director_hayaomiyazaki000","Actors":["actor_rumihiiragi000","actor_miyuirino000","actor_marinatsuki000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/d/db/Spirited_Away_Japanese_poster.png","Featured":false}
{"_id":"movie_ratatouille000","Title":"Ratatouille","ReleaseYear":"xxxx","Rating":"G","Runtime":"1h 51m","Description":"Ratatouille is a 2007 American animated comedy-drama film produced by Pixar Animation Studios for Walt Disney Pictures. The eighth film produced by Pixar, it was written and directed by Brad Bird and produced by Brad Lewis, from an original idea by Jan Pinkava, who was credited for conceiving the film's story with Bird and Jim Capobianco. The film stars the voices of Patton Oswalt, Lou Romano, Ian Holm, Janeane Garofalo, Peter O'Toole, Brian Dennehy, Peter Sohn and Brad Garrett. The title refers to the French dish ratatouille, which is served at the end of the film, and also references the species of the main character, a rat. Set mostly in Paris, the plot follows a young rat Remy (Oswalt) who dreams of becoming a chef at Auguste Gusteau's (Garrett) restaurant and tries to achieve his goal by forming an unlikely alliance with the restaurant's garbage boy Alfredo Linguini (Romano).","Genres":["genre_animation000","genre_adventure000","genre_comedy000"],"Director":"director_bradbird000","Actors":["actor_pattonoswalt000","actor_ianhom000","actor_louromano000"],"ImagePath":"https://upload.wikimedia.org/wikipedia/en/5/50/RatatouillePoster.jpg","Featured":false}
