{
    "name": "Morgan Freeman",
    "birthDate": "1937-06-01",
    "deathDate": "",
    "bio": "Morgan Freeman is an American actor and film narrator. He is known for his distinctive deep voice and roles in films such as The Shawshank Redemption, Driving Miss Daisy, and Million Dollar Baby.",
    "movies": [
        "The Shawshank Redemption"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Morgan_Freeman_at_The_Pentagon_on_2_August_2023_-_230802-D-PM193-3363_(cropped).jpg"
}
{
    "name": "Tim Robbins",
    "birthDate": "1958-10-16",
    "deathDate": "",
    "bio": "Tim Robbins is an American actor, director, and producer. He is known for his roles in films such as The Shawshank Redemption, Mystic River, and Bull Durham.",
    "movies": [
        "The Shawshank Redemption"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Tim_Robbins_(Berlin_Film_Festival_2013).jpg"
}
{
    "name": "Michael Caine",
    "birthDate": "1933-03-14",
    "deathDate": "",
    "bio": "Michael Caine is an English actor known for his distinctive Cockney accent and range of performances. He has won numerous awards throughout his career, including two Academy Awards. Caine's notable films include The Dark Knight trilogy, The Italian Job, and The Cider House Rules.",
    "movies": [
        "The Dark Knight"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Michael_Caine_-_Viennale_2012_a_(cropped).jpg"
}
{
    "name": "Robert De Niro",
    "birthDate": "1943-08-17",
    "deathDate": "",
    "bio": "Robert De Niro is an American actor, producer, and director. He has received numerous accolades, including two Academy Awards, a Golden Globe Award, and the Cecil B. DeMille Award. De Niro is known for his roles in films such as Taxi Driver, Raging Bull, and Goodfellas.",
    "movies": [
        "The Godfather Part II"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Robert_De_Niro_Cannes_2016_2.jpg"
}
{
    "name": "Robert Duvall",
    "birthDate": "1931-01-05",
    "deathDate": "",
    "bio": "Robert Duvall is an American actor and filmmaker. He has been nominated for seven Academy Awards and has won one for his performance in Tender Mercies. Duvall is known for his roles in films such as The Godfather, Apocalypse Now, and Lonesome Dove.",
    "movies": [
        "The Godfather Part II"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Robert_Duvall_1.jpg"
}
{
    "name": "Heath Ledger",
    "birthDate": "1979-04-04",
    "deathDate": "2008-01-22",
    "bio": "Heath Ledger was an Australian actor known for his groundbreaking performance as the Joker in The Dark Knight. Ledger's other notable films include Brokeback Mountain, A Knight's Tale, and 10 Things I Hate About You.",
    "movies": [
        "The Dark Knight"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Heath_Ledger_(2).jpg"
}
{
    "name": "James Caan",
    "birthDate": "1940-03-26",
    "deathDate": "",
    "bio": "James Caan is an American actor. He is best known for his roles in films such as The Godfather, Misery, and Elf.",
    "movies": [
        "The Godfather"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:James_Caan_(1976).jpg"
}
{
    "name": "Henry Fonda",
    "birthDate": "1905-05-16",
    "deathDate": "1982-08-12",
    "bio": "Henry Fonda was an American actor known for his roles in classic films such as 12 Angry Men, The Grapes of Wrath, and On Golden Pond. He was a highly respected actor with a career spanning over five decades, earning two Academy Awards and a Tony Award.",
    "movies": [
        "12 Angry Men"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Henry_Fonda_in_Warlock.jpg"
}
{
    "name": "Christian Bale",
    "birthDate": "1974-01-30",
    "deathDate": "",
    "bio": "Christian Bale is a Welsh actor known for his intense method acting style. He has received various awards, including an Academy Award and a Golden Globe Award. Bale is known for his roles in films such as The Dark Knight trilogy, American Psycho, and The Fighter.",
    "movies": [
        "The Dark Knight"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Christian_Bale-7837.jpg"
}
{
    "name": "Ben Kingsley",
    "birthDate": "1943-12-31",
    "deathDate": "",
    "bio": "Ben Kingsley is a British actor known for his powerful performances in films such as Gandhi, Schindler's List, and Sexy Beast. With his remarkable versatility and talent, Kingsley has won numerous awards, including an Academy Award for Best Actor for his role in Gandhi.",
    "movies": [
        "Schindler's List"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Ben_Kingsley_by_Gage_Skidmore.jpg"
}
{
    "name": "Bob Gunton",
    "birthDate": "1945-11-15",
    "deathDate": "",
    "bio": "Bob Gunton is an American actor known for his roles in films such as The Shawshank Redemption, JFK, and Patch Adams.",
    "movies": [
        "The Shawshank Redemption"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Bob_Gunton,_1963_senior_photo.jpg"
}
{
    "name": "Lee J. Cobb",
    "birthDate": "1911-12-08",
    "deathDate": "1976-02-11",
    "bio": "Lee J. Cobb was an American actor best known for his roles in 12 Angry Men, On the Waterfront, and The Exorcist. He was a versatile performer who excelled in both stage and film, earning two Academy Award nominations and numerous other accolades throughout his career.",
    "movies": [
        "12 Angry Men"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Lee_J._Cobb_1960s.JPG"
}
{
    "name": "Liam Neeson",
    "birthDate": "1952-06-07",
    "deathDate": "",
    "bio": "Liam Neeson is an Irish actor known for his versatile roles in films such as Schindler's List, Taken, and The Dark Knight Trilogy. With a commanding presence and a wide range of performances, Neeson has become one of the most respected actors in Hollywood.",
    "movies": [
        "Schindler's List"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Liam_Neeson_Deauville_2012.jpg"
}
{
    "name": "Ed Begley",
    "birthDate": "1901-03-25",
    "deathDate": "1970-04-28",
    "bio": "Ed Begley was an American actor known for his roles in classic films such as 12 Angry Men, Sweet Bird of Youth, and The Unsinkable Molly Brown. He was a versatile actor who also appeared in numerous television shows and stage productions throughout his career.",
    "movies": [
        "12 Angry Men"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Ed_Begley_1958.jpg"
}
{
    "name": "Marlon Brando",
    "birthDate": "1924-04-03",
    "deathDate": "2004-07-01",
    "bio": "Marlon Brando was an American actor and film director. He is widely regarded as one of the greatest actors of all time. Brando's performances in A Streetcar Named Desire, On the Waterfront, and The Godfather are considered iconic in the history of cinema.",
    "movies": [
        "The Godfather"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Marlon_Brando_publicity_for_One-Eyed_Jacks.png"
}
{
    "name": "Ralph Fiennes",
    "birthDate": "1962-12-22",
    "deathDate": "",
    "bio": "Ralph Fiennes is an English actor known for his compelling performances in films such as Schindler's List, The English Patient, and the Harry Potter series. With his intense portrayals and remarkable range, Fiennes has established himself as one of the finest actors of his generation.",
    "movies": [
        "Schindler's List"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Ralph_Fiennes_from_%22The_White_Crow%22_at_Opening_Ceremony_of_the_Tokyo_International_Film_Festival_2018_(31747095048).jpg"
}
{
    "name": "Al Pacino",
    "birthDate": "1940-04-25",
    "deathDate": "",
    "bio": "Al Pacino is an American actor and filmmaker. He has had a career spanning over five decades, during which he has received numerous accolades, including an Academy Award, two Tony Awards, and two Primetime Emmy Awards. Pacino's performances in The Godfather, Serpico, and Dog Day Afternoon are widely acclaimed.",
    "movies": [
        "The Godfather", "The Godfather Part II"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Al_Pacino_2016_(30401544240).jpg"
}
{
    "name": "Ian McKellen",
    "birthDate": "1939-05-25",
    "deathDate": "",
    "bio": "Ian McKellen is an English actor known for his acclaimed performances in both theater and film. He is particularly well-known for his roles as Gandalf in The Lord of the Rings trilogy and Magneto in the X-Men film series. McKellen's talent and versatility have earned him numerous awards and widespread recognition.",
    "movies": [
        "The Lord of the Rings: The Return of the King", "The Lord of the Rings: The Two Towers", "The Lord of the Rings: The Fellowship of the Ring"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:McKellenRichmnd040219-5_(46275370484)_(cropped).jpg"
}
{
    "name": "Elijah Wood",
    "birthDate": "1981-01-28",
    "deathDate": "",
    "bio": "Elijah Wood is an American actor known for his iconic role as Frodo Baggins in The Lord of the Rings trilogy. With his talent and versatility, Wood has appeared in a wide range of films and TV shows, showcasing his ability to portray diverse characters.",
    "movies": [
        "The Lord of the Rings: The Return of the King", "The Lord of the Rings: The Two Towers", "The Lord of the Rings: The Fellowship of the Ring"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Elijah_Wood_(47955397556)_(cropped).jpg"
}
{
    "name": "John Travolta",
    "birthDate": "1954-02-18",
    "deathDate": "",
    "bio": "John Travolta is an American actor and singer who rose to fame in the 1970s with his roles in Saturday Night Fever and Grease. Known for his charisma and versatility, Travolta has enjoyed a successful career spanning decades, with notable performances in Pulp Fiction, Get Shorty, and Hairspray.",
    "movies": [
        "Pulp Fiction"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:John_Travolta,_2014_(cropped).jpg"
}
{
    "name": "Liv Tyler",
    "birthDate": "1977-07-01",
    "deathDate": "",
    "bio": "Liv Tyler is an American actress known for her roles in films such as The Lord of the Rings trilogy, Armageddon, and Stealing Beauty. With her talent and beauty, Tyler has captivated audiences on both the big screen and television, establishing herself as a versatile and acclaimed actress.",
    "movies": [
        "The Lord of the Rings: The Return of the King", "The Lord of the Rings: The Two Towers", "The Lord of the Rings: The Fellowship of the Ring"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Liv_Tyler_(29566238128)_(cropped).jpg"
}
{
    "name": "Uma Thurman",
    "birthDate": "1970-04-29",
    "deathDate": "",
    "bio": "Uma Thurman is an American actress known for her captivating performances in films such as Pulp Fiction, Kill Bill, and Gattaca. With her talent and beauty, Thurman has left a lasting impression on audiences and critics alike, establishing herself as a versatile and acclaimed actress in Hollywood.",
    "movies": [
        "Pulp Fiction"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Uma_Thurman_Cannes_2017_(cropped).jpg"
}
{
    "name": "Samuel L. Jackson",
    "birthDate": "1948-12-21",
    "deathDate": "",
    "bio": "Samuel L. Jackson is an American actor and producer known for his iconic roles in films such as Pulp Fiction, Jurassic Park, and the Marvel Cinematic Universe, where he portrays Nick Fury. With his commanding presence and versatility, Jackson has become one of the most recognizable and respected actors in Hollywood.",
    "movies": [
        "Pulp Fiction"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:SamuelLJackson.jpg"
}
{
    "name": "Eli Wallach",
    "birthDate": "1915-12-07",
    "deathDate": "2014-06-24",
    "bio": "Eli Wallach was an American actor known for his versatility and memorable performances in films such as The Good, the Bad and the Ugly, The Magnificent Seven, and The Godfather Part III. With his talent and distinctive presence, Wallach left a lasting legacy in the world of cinema.",
    "movies": [
        "The Good, the Bad and the Ugly",
        "The Magnificent Seven"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Eli_Wallach_-_publicity.jpg"
}
{
    "name": "Tom Hanks",
    "birthDate": "1956-07-09",
    "deathDate": "",
    "bio": "Tom Hanks is an American actor and filmmaker known for his wide range of roles in films such as Forrest Gump, Saving Private Ryan, and Cast Away. With his natural charm and versatility, Hanks has become one of the most respected and beloved actors in Hollywood, earning multiple awards and nominations throughout his career.",
    "movies": [
        "Forrest Gump",
        "Saving Private Ryan"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Tom_Hanks_TIFF_2019.jpg"
}
{
    "name": "Robin Wright",
    "birthDate": "1966-04-08",
    "deathDate": "",
    "bio": "Robin Wright is an American actress known for her captivating performances in films such as Forrest Gump, The Princess Bride, and House of Cards. With her talent and versatility, Wright has garnered critical acclaim and established herself as one of the most talented actresses in Hollywood.",
    "movies": [
        "Forrest Gump"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Robin_Wright_2009.jpg"
}
{
    "name": "Gary Sinise",
    "birthDate": "1955-03-17",
    "deathDate": "",
    "bio": "Gary Sinise is an American actor, director, and musician known for his roles in films such as Forrest Gump, Apollo 13, and The Green Mile. He is also recognized for his philanthropic work, particularly in support of veterans and active-duty service members. Sinise has received various awards for his contributions to both the entertainment industry and his charitable efforts.",
    "movies": [
        "Forrest Gump"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Gary_Sinise_2011_(cropped).jpg"
}
{
    "name": "Lee Van Cleef",
    "birthDate": "1925-01-09",
    "deathDate": "1989-12-16",
    "bio": "Lee Van Cleef was an American actor known for his roles in numerous western films, including The Good, the Bad and the Ugly, For a Few Dollars More, and Escape from New York. With his distinctive looks and strong screen presence, Van Cleef became one of the most recognizable faces in the genre.",
    "movies": [
        "The Good, the Bad and the Ugly"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Lee_Van_Cleef_-_Death_Rides_A_Horse_(1).jpg"
}
{
    "name": "Edward Norton",
    "birthDate": "1969-08-18",
    "deathDate": "",
    "bio": "Edward Norton is an American actor and filmmaker known for his versatile performances in films such as Fight Club, American History X, and Birdman. Norton has received critical acclaim for his acting skills and has been nominated for multiple awards, including Academy Awards and Golden Globes. In addition to his acting career, Norton is also actively involved in environmental and social causes.",
    "movies": [
        "Fight Club"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Ed_Norton_Shankbone_Metropolitan_Opera_2009.jpg"
}
{
    "name": "Brad Pitt",
    "birthDate": "1963-12-18",
    "deathDate": "",
    "bio": "Brad Pitt is an American actor and film producer known for his roles in a wide range of films, including Fight Club, Ocean's Eleven, and Once Upon a Time in Hollywood. With his charismatic presence and versatile performances, Pitt has become one of the most influential and highest-paid actors in Hollywood, earning numerous awards and nominations throughout his career.",
    "movies": [
        "Fight Club"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Brad_Pitt_2019_by_Glenn_Francis.jpg"
}
{
    "name": "Helena Bonham Carter",
    "birthDate": "1966-05-26",
    "deathDate": "",
    "bio": "Helena Bonham Carter is a British actress known for her versatile roles in films such as The King's Speech, Fight Club, and the Harry Potter series. With her distinctive acting style and ability to portray complex characters, she has earned critical acclaim and numerous award nominations throughout her career. Carter is also recognized for her work in stage productions and her contributions to various charitable causes.",
    "movies": [
        "Fight Club"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Helena_Bonham_Carter_2011_AA.jpg"
}
{
    "name": "Leonardo DiCaprio",
    "birthDate": "1974-11-11",
    "deathDate": "",
    "bio": "Leonardo DiCaprio is an American actor and film producer known for his roles in films such as Titanic, Inception, and The Revenant. He has received numerous accolades, including an Academy Award for Best Actor, and has been praised for his commitment to challenging and diverse roles. DiCaprio is also an environmental activist, advocating for environmental conservation and sustainability.",
    "movies": [
        "Inception"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Leonardo_Dicaprio_Cannes_2019.jpg"
}
{
    "name": "Jack Nicholson",
    "birthDate": "1937-04-22",
    "deathDate": "",
    "bio": "Jack Nicholson is an American actor, producer, writer, and director. He is known for his distinctive voice, expressive face, and iconic roles in films such as One Flew Over the Cuckoo's Nest, The Shining, and Batman. Nicholson has received numerous awards, including three Academy Awards for Best Actor and twelve nominations in total, making him the most nominated male actor in the history of the Academy Awards.",
    "movies": [
        "One Flew Over the Cuckoo's Nest"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Jack_Nicholson_2001.jpg"
}
{
    "name": "Ken Watanabe",
    "birthDate": "1959-10-21",
    "deathDate": "",
    "bio": "Ken Watanabe is a Japanese actor known for his roles in both Japanese and international films. He gained widespread recognition for his performances in films such as The Last Samurai, Inception, and Godzilla. Watanabe's talent and versatility have earned him critical acclaim and numerous awards in Japan and abroad.",
    "movies": [
        "Inception"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Ken_Watanabe_2007_(cropped).jpg"
}
{
    "name": "Joseph Gordon-Levitt",
    "birthDate": "1981-02-17",
    "deathDate": "",
    "bio": "Joseph Gordon-Levitt is an American actor, filmmaker, singer, and entrepreneur. He began his career as a child actor, appearing in television commercials and sitcoms before transitioning to film roles. Gordon-Levitt has since gained recognition for his performances in films such as Inception, (500) Days of Summer, and The Dark Knight Rises. He is also known for his work as a writer, director, and producer, founding the online collaborative production company HitRecord.",
    "movies": [
        "Inception"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Joseph_Gordon-Levitt_TechCrunch_Disrupt_San_Francisco_2019_-_Day_1_(cropped).jpeg"
}
{
    "name": "Clint Eastwood",
    "birthDate": "1930-05-31",
    "deathDate": "",
    "bio": "Clint Eastwood is an American actor, filmmaker, and political figure known for his iconic roles in films such as The Good, the Bad and the Ugly, Dirty Harry, and Unforgiven. As both an actor and director, Eastwood has earned numerous awards and accolades for his contributions to the film industry.",
    "movies": [
        "The Good, the Bad and the Ugly"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Clint_Eastwood_at_2010_New_York_Film_Festival.jpg"
}
{
    "name": "Anne Hathaway",
    "birthDate": "1982-11-12",
    "deathDate": "",
    "bio": "Anne Hathaway is an American actress known for her versatile performances in film and theater. She gained widespread recognition for her roles in films such as The Princess Diaries, Les Misérables, and The Devil Wears Prada, for which she won the Academy Award for Best Supporting Actress. Hathaway's talent, charm, and dedication to her craft have made her one of the most sought-after actresses in Hollywood.",
    "movies": [
        "Interstellar"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Anne_Hathaway-68408_(cropped).jpg"
}
{
    "name": "William Redfield",
    "birthDate": "1927-01-26",
    "deathDate": "1976-08-17",
    "bio": "William Redfield was an American actor known for his work on stage, film, and television. He appeared in various Broadway productions and gained recognition for his roles in films such as One Flew Over the Cuckoo's Nest and Fantastic Voyage. Redfield's talent and versatility as an actor left a lasting impact on the entertainment industry.",
    "movies": [
        "One Flew Over the Cuckoo's Nest"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Publicity_Photo_of_William_Redfield.jpg"
}
{
    "name": "Matthew McConaughey",
    "birthDate": "1969-11-04",
    "deathDate": "",
    "bio": "Matthew McConaughey is an American actor and producer known for his charismatic performances and Southern drawl. He gained widespread recognition for his roles in films such as Dazed and Confused, Dallas Buyers Club, and Interstellar, for which he won the Academy Award for Best Actor. McConaughey's versatility and dedication to his craft have earned him critical acclaim and a prominent place in Hollywood.",
    "movies": [
        "Interstellar"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Matthew_McConaughey_2019_(48648344772).jpg"
}
{
    "name": "Louise Fletcher",
    "birthDate": "1934-07-22",
    "deathDate": "",
    "bio": "Louise Fletcher is an American actress known for her portrayal of Nurse Ratched in the film One Flew Over the Cuckoo's Nest, for which she won the Academy Award for Best Actress. She has appeared in numerous other films and television shows, showcasing her versatility as an actress. Fletcher's career has spanned several decades, and she continues to be recognized for her contributions to the entertainment industry.",
    "movies": [
        "One Flew Over the Cuckoo's Nest"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:LouiseFletcherOscar_(cropped).jpg"
}
{
    "name": "Takashi Shimura",
    "birthDate": "1905-03-12",
    "deathDate": "1982-02-11",
    "bio": "Takashi Shimura was a Japanese actor known for his profound performances and collaboration with director Akira Kurosawa. He gained international recognition for his roles in films such as Ikiru, Seven Samurai, and Rashomon. Shimura's subtle and nuanced acting style made him one of the most respected actors in Japanese cinema.",
    "movies": [
        "Seven Samurai"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Shimura_Takashi.JPG"
}
{
    "name": "Steve McQueen",
    "birthDate": "1930-03-24",
    "deathDate": "1980-11-07",
    "bio": "Steve McQueen was an American actor known as the 'King of Cool' for his antihero persona and iconic roles in films such as The Great Escape, Bullitt, and The Thomas Crown Affair. He was one of the top box-office draws of the 1960s and 1970s, known for his rugged good looks and intense on-screen presence. McQueen's legacy as a Hollywood icon continues to influence actors and filmmakers today.",
    "movies": [
        "The Magnificent Seven",
        "The Great Escape"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Steve-McQueen-1968_(cropped).jpg"
}
{
    "name": "Jessica Chastain",
    "birthDate": "1977-03-24",
    "deathDate": "",
    "bio": "Jessica Chastain is an American actress known for her versatile performances across film and theater. She gained widespread recognition for her roles in films such as The Help, Zero Dark Thirty, and Molly's Game, receiving multiple nominations and awards for her work. Chastain's talent and dedication to her craft have solidified her as one of the most respected actresses in Hollywood.",
    "movies": [
        "Interstellar"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Jessica_Chastain_Cannes_2016_4_(cropped).jpg"
}
{
    "name": "Michael J. Fox",
    "birthDate": "1961-06-09",
    "deathDate": "",
    "bio": "Michael J. Fox is a Canadian-American actor, author, and activist known for his roles in iconic films and television series such as Back to the Future, Family Ties, and Spin City. Despite being diagnosed with Parkinson's disease in 1991, Fox continued to act and advocate for research towards finding a cure for the condition. He remains an inspiration to many for his resilience and contributions to both entertainment and medical research.",
    "movies": [
        "Back to the Future"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Michael_J_Fox_2020.jpg"
}
{
    "name": "Christopher Lloyd",
    "birthDate": "1938-10-22",
    "deathDate": "",
    "bio": "Christopher Lloyd is an American actor known for his versatile performances in film, television, and theater. He is perhaps best recognized for his role as Dr. Emmett 'Doc' Brown in the Back to the Future trilogy, as well as his portrayal of Uncle Fester in The Addams Family films. Lloyd's career spans several decades and includes a wide range of memorable characters, showcasing his talent and versatility as an actor.",
    "movies": [
        "Back to the Future"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:ChristopherLloyd2022.jpg"
}
{
    "name": "Lea Thompson",
    "birthDate": "1961-05-31",
    "deathDate": "",
    "bio": "Lea Thompson is an American actress, director, and producer known for her roles in popular films and television series such as Back to the Future, Some Kind of Wonderful, and Caroline in the City. With a career spanning over four decades, Thompson has established herself as a versatile and talented performer, garnering acclaim for her work in both comedic and dramatic roles.",
    "movies": [
        "Back to the Future"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Lea_Thompson_February_2015_crop.JPG"
}
{
    "name": "Rumi Hiiragi",
    "birthDate": "1988-08-01",
    "deathDate": "",
    "bio": "Rumi Hiiragi is a Japanese actress and voice actress known for her work in animated films and television series. She gained international recognition for her role as Chihiro Ogino in the critically acclaimed animated film Spirited Away, directed by Hayao Miyazaki. Hiiragi's talent and versatility as a voice actress have made her a respected figure in the Japanese entertainment industry.",
    "movies": [
        "Spirited Away"
    ],
    "imagePath": "https://healthyceleb.com/wp-content/uploads/2022/03/Rumi-Hiiragi-as-seen-in-an-Instagram-Post-in-May-2018.jpg"
}
{
    "name": "James Garner",
    "birthDate": "1928-04-07",
    "deathDate": "2014-07-19",
    "bio": "James Garner was an American actor known for his roles in television series such as Maverick and The Rockford Files, as well as films like The Great Escape, The Notebook, and Murphy's Romance. With his rugged charm and easygoing demeanor, Garner became a beloved figure in Hollywood, earning multiple awards and nominations throughout his career. He left a lasting impact on the entertainment industry and is remembered fondly by fans around the world.",
    "movies": [
        "The Great Escape"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:James_Garner_Bret_Maverick.JPG"
}
{
    "name": "Miyu Irino",
    "birthDate": "1988-02-19",
    "deathDate": "",
    "bio": "Miyu Irino is a Japanese actor and voice actor known for his work in animated films and television series. He has provided voices for numerous iconic characters in popular anime productions, including Sora in the Kingdom Hearts series, Haku in Spirited Away, and Shoya Ishida in A Silent Voice. Irino's talent and versatility as a voice actor have earned him recognition and admiration from fans worldwide.",
    "movies": [
        "Spirited Away"
    ],
    "imagePath": "https://www.handthatfeedshq.com/wp-content/uploads/2017/07/miyu-irino.jpg"
}
{
    "name": "Patton Oswalt",
    "birthDate": "1969-01-27",
    "deathDate": "",
    "bio": "Patton Oswalt is an American actor, comedian, and writer known for his witty humor and unique storytelling style. He has appeared in numerous films and television shows, including Ratatouille, where he provided the voice of Remy the rat. Oswalt's comedy specials and performances have earned him critical acclaim and a dedicated fanbase.",
    "movies": [
        "Ratatouille"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Patton_Oswalt_by_Gage_Skidmore_3_(cropped).jpg"
}
{
    "name": "Keiko Tsushima",
    "birthDate": "1926-02-21",
    "deathDate": "2012-08-01",
    "bio": "Keiko Tsushima was a Japanese actress best known for her role as Lady Asaji Washizu in Akira Kurosawa's film Throne of Blood. Her performance in the film showcased her talent and versatility as an actress. Tsushima's contribution to Japanese cinema continues to be remembered and celebrated.",
    "movies": [
        "Seven Samurai"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Keiko_Tsushima_1.jpg"
}
{
    "name": "Mari Natsuki",
    "birthDate": "1952-05-02",
    "deathDate": "",
    "bio": "Mari Natsuki is a Japanese singer, actress, and voice actress known for her versatile performances in film, television, and theater. She gained international recognition for her role as Yubaba in the critically acclaimed animated film Spirited Away, directed by Hayao Miyazaki. Natsuki's talent and unique voice have made her a respected figure in the Japanese entertainment industry.",
    "movies": [
        "Spirited Away"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:MJK_08427_Mari_Natsuki_(Berlinale_2018).jpg"
}
{
    "name": "Ian Holm",
    "birthDate": "1931-09-12",
    "deathDate": "2020-06-19",
    "bio": "Sir Ian Holm was a renowned English actor known for his versatile performances on stage and screen. He gained international recognition for his role as Bilbo Baggins in The Lord of the Rings film series and as Ash in Alien. Holm's distinguished career spanned over six decades, during which he received numerous awards and accolades for his contributions to the arts.",
    "movies": [
        "Ratatouille"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Ian_Holm.jpg"
}
{
    "name": "Lou Romano",
    "birthDate": "1972-04-15",
    "deathDate": "",
    "bio": "Lou Romano is an American animator and voice actor best known for his work with Pixar Animation Studios. He provided the voice of Linguini in the animated film Ratatouille and has also contributed to other Pixar projects such as The Incredibles and Up. Romano's talent and creativity have made him an integral part of the animation industry.",
    "movies": [
        "Ratatouille"
    ],
    "imagePath": "https://media.themoviedb.org/t/p/w300_and_h450_bestv2/1qOuqRzlp5BghzTkYSN3MsaEXgF.jpg"
}
{
    "name": "Toshiro Mifune",
    "birthDate": "1920-04-01",
    "deathDate": "1997-12-24",
    "bio": "Toshiro Mifune was a Japanese actor known for his powerful performances and collaboration with director Akira Kurosawa. He gained international recognition for his roles in films such as Rashomon, Seven Samurai, and Yojimbo. Mifune's commanding presence and dynamic acting style have left an indelible mark on world cinema.",
    "movies": [
        "Seven Samurai"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Toshiro_Mifune_1954_Scan10003_160913.jpg"
}
{
    "name": "Yul Brynner",
    "birthDate": "1920-07-11",
    "deathDate": "1985-10-10",
    "bio": "Yul Brynner was a Russian-American actor best known for his portrayal of King Mongkut of Siam in the musical The King and I, for which he won an Academy Award for Best Actor. He also starred as the gunslinger Chris Adams in The Magnificent Seven and its sequels, solidifying his status as a Hollywood legend known for his distinctive bald head and commanding presence on screen.",
    "movies": [
        "The Magnificent Seven"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Publicity_press_photo_of_Yul_Brynner_in_1960_(cropped).jpg"
}
{
    "name": "Richard Attenborough",
    "birthDate": "1923-08-29",
    "deathDate": "2014-08-24",
    "bio": "Richard Attenborough was a British actor, director, and producer known for his work in film and theater. He achieved international acclaim for his role as Pinkie Brown in Brighton Rock and went on to star in films like The Great Escape and Jurassic Park. As a director, Attenborough helmed critically acclaimed films such as Gandhi, for which he won two Academy Awards. He was a highly respected figure in the entertainment industry and made significant contributions to cinema throughout his career.",
    "movies": [
        "The Great Escape"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Regisseur_Richard_Attenborough,_Bestanddeelnr_928-0661.jpg"
}
{
    "name": "Edward Burns",
    "birthDate": "1968-01-29",
    "deathDate": "",
    "bio": "Edward Burns is an American actor, director, and writer known for his independent films that often explore themes of relationships and urban life. He gained critical acclaim for his debut film The Brothers McMullen, which he wrote, directed, and starred in. Burns' unique storytelling style and authentic portrayals of characters have earned him a dedicated following in the indie film scene.",
    "movies": [
        "Saving Private Ryan"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Edward_Burns_cropped.jpg"
}
{
    "name": "Matt Damon",
    "birthDate": "1970-10-08",
    "deathDate": "",
    "bio": "Matt Damon is an American actor, producer, and screenwriter known for his versatility and range in film roles. He gained widespread recognition for his performance in Good Will Hunting, which he co-wrote with Ben Affleck and for which he received an Academy Award for Best Original Screenplay. Damon has since appeared in numerous successful films, showcasing his talent across various genres.",
    "movies": [
        "Saving Private Ryan"
    ],
    "imagePath": "https://en.wikipedia.org/wiki/File:Matt_Damon,_Berlinale_2023_(cropped).jpg"
}